Tutorials/pimpleHFDIBFoam/pipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-1 2 0.1)
    (-1 0 0.1)
    (-1 0 -0.1)
    (-1 2 -0.1)
    (4 2 0.1)
    (4 0 0.1)
    (4 0 -0.1)
    (4 2 -0.1)
    
    (6 2 0.1)
    (6 0 0.1)
    (6 0 -0.1)
    (6 2 -0.1)
    
    (4 4 0.1)
    (6 4 0.1)
    (6 4 -0.1)
    (4 4 -0.1)
    
    (4 6 0.1)
    (6 6 0.1)
    (6 6 -0.1)
    (4 6 -0.1)
    
    (2 6 0.1)
    (2 4 0.1)
    (2 4 -0.1)
    (2 6 -0.1)
    
    (0 6 0.1)
    (0 4 0.1)
    (0 4 -0.1)
    (0 6 -0.1)
    
    (0 8 0.1)
    (2 8 0.1)
    (2 8 -0.1)
    (0 8 -0.1)
    
    (0 10 0.1)
    (2 10 0.1)
    (2 10 -0.1)
    (0 10 -0.1)
    
    (4 10 0.1)
    (4 8 0.1)
    (4 8 -0.1)
    (4 10 -0.1)
);

blocks
(
    hex (2 6 7 3 1 5 4 0) (150 60 1) simpleGrading (1 1 1)
    hex (6 10 11 7 5 9 8 4) (60 60 1) simpleGrading (1 1 1)
    hex (7 11 14 15 4 8 13 12) (60 60 1) simpleGrading (1 1 1)
    hex (15 14 18 19 12 13 17 16) (60 60 1) simpleGrading (1 1 1)
    hex (22 15 19 23 21 12 16 20) (60 60 1) simpleGrading (1 1 1)
    hex (26 22 23 27 25 21 20 24) (60 60 1) simpleGrading (1 1 1)
    hex (27 23 30 31 24 20 29 28) (60 60 1) simpleGrading (1 1 1)
    hex (31 30 34 35 28 29 33 32) (60 60 1) simpleGrading (1 1 1)
    hex (30 38 39 34 29 37 36 33) (60 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (0 3 7 4)
            (5 9 10 6)
            (9 8 11 10)
            (12 4 7 15)
            (14 11 8 13)
            (18 14 13 17)
            (16 19 18 17)
            (20 23 19 16)
            (12 15 22 21)
            (21 22 26 25)
            (24 25 26 27)
            (28 24 27 31)
            (29 30 23 20)
            (28 31 35 32)
            (32 35 34 33)
            (29 37 38 30)
            (33 34 39 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (39 38 37 36)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (7 3 2 6)
            (4 8 9 5)
            (7 6 10 11)
            (8 4 12 13)
            (7 11 14 15)
            (16 17 13 12)
            (19 15 14 18)
            (20 16 12 21)
            (22 15 19 23)
            (20 21 25 24)
            (26 22 23 27)
            (28 29 20 24)
            (27 23 30 31)
            (29 28 32 33)
            (31 30 34 35)
            (29 33 36 37)
            (30 38 39 34)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
